const tools = {
    mobile: "شماره موبایل",
    melli: "کد ملی",
    card: "شماره کارت",
    sheba: "شماره شبا",
    postal: "کد پستی",
    name: "نام و نام خانوادگی",
    email: "ایمیل",
    password: "رمز عبور",
    address: "آدرس"
};

const operators = {
    "همراه اول": [
        '0910','0911','0912','0913','0914','0915','0916','0917','0918','0919',
        '0990','0991'
    ],
    "ایرانسل": [
        '0901','0902','0903','0905',
        '0930','0933','0935','0936','0937','0938','0939',
        '0998'
    ],
    "رایتل": ['0920','0921','0922'],
    "شاتل موبایل": ['0997'],
    "سامانتل": ['0999'],
    "آپتل": ['0992']
};


const banks = {
    "ملی": ["603799"],
    "ملت": ["610433"],
    "صادرات": ["603769"],
    "تجارت": ["627353"],
    "کشاورزی": ["603770"],
    "پاسارگاد": ["502229"],
    "پارسیان": ["622106","639194"],
    "سامان": ["621986","639346"],
    "شهر": ["502806"],
    "رفاه": ["589463"],
    "مسکن": ["628023"],
    "پست بانک": ["627760"],
    "اقتصاد نوین": ["627412"],
    "کارآفرین": ["627488"],
    "سرمایه": ["639607"],
    "سینا": ["639346"],
    "رسالت": ["504172"],
    "آینده": ["636214"]
};


const postalData = {

"تهران": {
    "تهران": ["11111","11999"],
    "ری": ["18111","18199"],
    "اسلامشهر": ["33111","33199"],
    "شهریار": ["33511","33599"],
    "ورامین": ["33711","33799"]
},

"اصفهان": {
    "اصفهان": ["81111","81999"],
    "کاشان": ["87111","87199"],
    "نجف آباد": ["85111","85199"],
    "خمینی شهر": ["84111","84199"]
},

"فارس": {
    "شیراز": ["71311","71999"],
    "مرودشت": ["73711","73799"],
    "لار": ["74311","74399"],
    "جهرم": ["74111","74199"]
},

"خراسان رضوی": {
    "مشهد": ["91311","91999"],
    "نیشابور": ["93111","93199"],
    "سبزوار": ["96111","96199"]
},

"آذربایجان شرقی": {
    "تبریز": ["51111","51999"],
    "مراغه": ["55111","55199"],
    "میانه": ["53111","53199"]
},

"مازندران": {
    "ساری": ["48111","48199"],
    "بابل": ["47111","47199"],
    "آمل": ["46111","46199"]
},

"گیلان": {
    "رشت": ["41311","41399"],
    "انزلی": ["43111","43199"],
    "لاهیجان": ["44111","44199"]
},

"البرز": {
    "کرج": ["31111","31999"],
    "نظرآباد": ["33311","33399"]
},

"کرمان": {
    "کرمان": ["76111","76999"],
    "رفسنجان": ["77111","77199"]
},

"یزد": {
    "یزد": ["89111","89199"],
    "میبد": ["89411","89499"]
},

"خوزستان": {
    "اهواز": ["61111","61999"],
    "آبادان": ["63111","63199"]
},

"قم": {
    "قم": ["37111","37199"]
},

"قزوین": {
    "قزوین": ["34111","34199"]
},

"همدان": {
    "همدان": ["65111","65199"]
},

"کرمانشاه": {
    "کرمانشاه": ["67111","67199"]
},

"زنجان": {
    "زنجان": ["45111","45199"]
},

"اردبیل": {
    "اردبیل": ["56111","56199"]
},

"بوشهر": {
    "بوشهر": ["75111","75199"]
},

"سیستان و بلوچستان": {
    "زاهدان": ["98111","98199"]
},

"گلستان": {
    "گرگان": ["49111","49199"]
},

"ایلام": {
    "ایلام": ["69311","69399"]
},

"کردستان": {
    "سنندج": ["66111","66199"]
},

"لرستان": {
    "خرم آباد": ["68111","68199"]
},

"مرکزی": {
    "اراک": ["38111","38199"]
},

"چهارمحال و بختیاری": {
    "شهرکرد": ["88111","88199"]
},

"کهگیلویه و بویراحمد": {
    "یاسوج": ["75911","75999"]
},

"خراسان شمالی": {
    "بجنورد": ["94111","94199"]
},

"خراسان جنوبی": {
    "بیرجند": ["97111","97199"]
},

"هرمزگان": {
    "بندرعباس": ["79111","79199"]
},

"سمنان": {
    "سمنان": ["35111","35199"]
}

};


const firstNamesFa = [
"علی","محمد","رضا","امیر","حسین","سارا","فاطمه","مهدی","محمدرضا","زهرا",
"مونا","حسنا","امید","آرزو","مهسا","امیرحسین","پارسا","نیما","مهتاب","سپهر",
"سامان","نرگس","مهیار","محسن","نگین","شیما","یاسمن","عسل","علی‌رضا","محمدمهدی",
"مهرداد","رویا","امین","عرفان","لاله","میلاد","حانیه","مینا","رها","آرمان",
"ندا","آرینا","رضوان","آتنا","نوید","لاله","پویا","مهشید","شایان","مریم",
"کامیار","نگار","پرهام","الینا","آرش","بهناز","نیلوفر","طاها","شهاب","آوا",
"عرفان","پریناز","سپیده","سینا","آیدا","سحر","رضا","نیایش","مهیار","سام",
"مهناز","ماهینا","علیرضا","هدی","امین","هلیا","حامد","لاله","آرشام","مهتاب",
"پریا","نیما","ماهک","آرشین","فرناز","مانی","عاطفه","نوید","آیناز","امیرعلی",
"مهرداد","یلدا","مهران","نیوشا","سینا","آتنا","شایان","ترانه","مهسا","آراد",
"کامبیز","نیلوفر","بهاره","آریا","سپهر","هستی","سامان","مهتاب","رضا","الهام",
"طاها","سحر","میلاد","آرمان","مینا","رها","پوریا","مهناز","امیرحسین","سپیده",
"محمدرضا","الناز","عرفان","آرزو","پویا","آیدا","حامد","مهشید","علی‌رضا","پریناز",
"نیما","ماهینا","آرش","سارا","مهیار","هلیا","مهتاب","سام","آرشام","مریم",
"نیایش","مانی","فرناز","علیرضا","آیناز","مهرداد","مهسا","آراد","هدی","نیوشا",
"شایان","مهناز","آتنا","ترانه","آریا","سپهر","هستی","کامیار","آرشین","مهتاب"
];


const lastNamesFa = [
"محمدی","حسینی","رضایی","کریمی","جعفری","اکبری","نجفی","موسوی","قاسمی","هاشمی",
"حیدری","صفوی","کاظمی","خانی","صادقی","میرزایی","پورمحمدی","زمانی","علیزاده","رحمانی",
"نصیری","مرادی","فراهانی","بابایی","شهریاری","عباسی","عبدی","رحیمی","سعیدی","رحمانپور",
"مرادی","سالاری","امامی","شاه‌وردی","گودرزی","اسماعیلی","نوروزی","خسروی","پورحسین","آقایی",
"فرهادی","بهزادی","صفاری","قربانی","نورانی","موسویان","فرجی","کریمیان","پوررضا","رستمی",
"شریفی","کاظمیان","حسنی","مرادیان","سلطانی","علیپور","جعفریان","نجفیان","قلی‌پور","ابراهیمی",
"رمضانی","خانیان","موسوی‌نژاد","نجفی‌نژاد","محمدی‌نژاد","کریمی‌نژاد","احمدی","رحمانیان",
"محمدیان","حیدریان","جعفری‌نژاد","رضایی‌نژاد","سادات","مظفری","پورمحمدیان","سجادی","توحیدی",
"قاسمی‌نژاد","نیکوکار","سعیدپور","فرهادیان","خلیلی","نوری","دهقانی","سلیمانی","فرجی‌نژاد",
"رحیم‌پور","باقری","زمانیان","اسدی","آشتیانی","نوروزیان","کریمیان","حسینیان","خانیان","پورنیا",
"هاشمیان","محمدیان","رحمان‌پور","قاسمیان","موسوی‌نژاد","مرادی‌نژاد","رضاییان","سعیدیان","جعفریان",
"کریمی‌پور","زمانیان","عباسیان","نوروزیان","حیدریان","محمدیان","رحمانیان"
];


const firstNamesEn = [
"Ali","Mohammad","Reza","Amir","Hosein","Sara","Fatemeh","Mehdi","MohammadReza","Zahra",
"Mona","Hosna","Omid","Arzo","Mahsa","AmirHossein","Parsa","Nima","Mahtab","Sepehr",
"Saman","Narges","Mehyar","Mohsen","Negar","Shima","Yasaman","Asal","AliReza","MohammadMehdi",
"Mehrdad","Roya","Amin","Erfan","Laleh","Milad","Hanieh","Mina","Raha","Arman",
"Neda","Arina","Rezvan","Athena","Navid","Laleh","Pouya","Mahshid","Shayan","Maryam",
"Kamyar","Negar","Parham","Alina","Arash","Behnaz","Niloofar","Taha","Shahab","Ava"
];

const lastNamesEn = [
"Mohammadi","Hosseini","Rezaei","Karimi","Jafari","Akbari","Najafi","Mousavi","Ghasemi","Hashemi",
"Heydari","Safavi","Kazemi","Khani","Sadeghi","Mirzaei","PourMohammadi","Zamani","Alizadeh","Rahmani",
"Nasiri","Moradi","Farahani","Babaei","Shahriari","Abbasi","Abdi","Rahimi","Saeidi","Rahmanpour",
"Moradian","Salari","Emami","Shahverdi","Goodarzi","Esmaeili","Nowrouzi","Khosravi","PourHosein","Aghaei",
"Farhadi","Behzadi","Safari","Ghorbani","Noorani","Mousavian","Faraji","Karimian","PourReza","Rostami",
"Sharifi","Kazemian","Hasani","Moradian","Soltani","Alipour","Jafarian","Najafian","Gholipour","Ebrahimi",
"Ramazani","Khaniyan","MousaviNejad","NajafiNejad","MohammadiNejad","KarimiNejad","Ahmadi","Rahmanian",
"Mohammadian","Heydarian","JafariNejad","RezaeNejad","Sadat","Mozaffari","PourMohammadian","Sajadi","Tavhidi",
"Ghasemian","Nikookar","Saeidpour","Farhadian","Khalili","Noori","Dehghani","Soleimani","FarjiNejad",
"Rahimpour","Bagheri","Zamanian","Asadi","Ashtiani","Nowrouzian","Karimian","Hosseinian","Khaniyan","PourNia",
"Hashemian","Mohammadian","RahmanPour","Ghasemian","MousaviNejad","MoradiNejad","Rezaeian","Saeidian","Jafarian",
"KarimiPour","Zamanian","Abbassian","Nowrouzian","Heydarian","Mohammadian","Rahmanian"
];

